{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "Person_Name",
    "2": "Brand_vehicule",
    "3": "Model_vehicule",
    "4": "Organization_Name",
    "5": "location",
    "6": "phone_number",
    "7": "IBAN",
    "8": "credit_card",
    "9": "date_time",
    "10": "email",
    "11": "Identification_Number"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Brand_vehicule": 2,
    "IBAN": 7,
    "Identification_Number": 11,
    "Model_vehicule": 3,
    "O": 0,
    "Organization_Name": 4,
    "Person_Name": 1,
    "credit_card": 8,
    "date_time": 9,
    "email": 10,
    "location": 5,
    "phone_number": 6
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
